# RemoveProfile Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
Truss..::..RemoveProfile Method
Truss Class See Also
---
Remove the profile of a truss.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public void RemoveProfile()
```

Visual Basic
---
```text
Public Sub RemoveProfile
```

Visual C++
---
```text
public:
void RemoveProfile()
```

# See Also
Truss Class
Autodesk.Revit.DB.Structure Namespace